package com.jay.java.算法.LeetCode;

/**
 * 秒的换算：ms(毫秒),μs(微秒),ns(纳秒),ps(皮秒)
 *
 * @author wangxuejie
 * @version 1.0
 * @date 2019-12-19 17:04
 */
public class TimeTest {
    /**
     * 皮秒，符号ps（英语：picosecond ）. 1皮秒等于一万亿分之一秒（10-12秒）
     *
     * <p>1,000 皮秒 = 1纳秒
     *
     * <p>1,000,000 皮秒 = 1微秒
     *
     * <p>1,000,000,000 皮秒 = 1毫秒
     *
     * <p>1,000,000,000,000 皮秒 = 1秒
     *
     * <p>纳秒
     *
     * <p>纳秒，符号ns（英语：nanosecond ）. 1纳秒等于十亿分之一秒（10-9秒）
     *
     * <p>1 纳秒 = 1000皮秒
     *
     * <p>1,000 纳秒 = 1微秒
     *
     * <p>1,000,000 纳秒 = 1毫秒
     *
     * <p>1,000,000,000 纳秒 = 1秒
     *
     * <p>微秒
     *
     * <p>微秒，符号μs（英语：microsecond ）. 1微秒等于一百万分之一秒（10-6秒）
     *
     * <p>0.000 001 微秒 = 1皮秒
     *
     * <p>0.001 微秒 = 1纳秒
     *
     * <p>1,000 微秒 = 1毫秒
     *
     * <p>1,000,000 微秒 = 1秒
     *
     * <p>毫秒
     *
     * <p>毫秒，符号ms（英语：millisecond ）. 1毫秒等于一千分之一秒（10-3秒）
     *
     * <p>0.000 000 001 毫秒 = 1皮秒
     *
     * <p>0.000 001 毫秒 = 1纳秒
     *
     * <p>0.001 毫秒 = 1微秒
     *
     * <p>1000 毫秒 = 1秒
     */
}
